#ifndef  _TGCOMAPI_H_
#define  _TGCOMAPI_H_

/******************************************************************************
*以下为变量类型
******************************************************************************/

/******************************************************************************
*以下为设备播放语音内容
******************************************************************************/
#define BI					0x00	//Bi
#define BIBI				0x01	//BiBi	
#define REG_SUCCESS			0x02	//登记成功
#define REG_FAIL 			0x03	//登记失败
#define PLS_REPUT			0x04	//请再放一次
#define PLS_PUT_CRUCLY     	0x05	//请正确放入手指
#define PLS_PUT_SOFTLY		0x06	//请自然轻放手指
#define IDENT_SUCCESS		0x07	//验证成功
#define IDENT_FAIL			0x08	//验证失败
#define PLS_REDO			0x09	//请重试
#define DEL_SUCCESS			0x0A	//删除成功
#define DEL_FAIL			0x0B	//删除失败
#define VEIN_FULL			0x0C	//指静脉已满
#define VOLUME0				0xE0	//最小音量级别0
#define VOLUME1				0xE1	//中间音量级别1
#define VOLUME2				0xE2	//中间音量级别2
#define VOLUME3				0xE3	//中间音量级别3
#define VOLUME4				0xE4	//中间音量级别4
#define VOLUME5				0xE5	//中间音量级别5
#define VOLUME6				0xE6	//中间音量级别6
#define VOLUME7				0xE7	//最大音量级别7

/******************************************************************************
*以下为Linux下接口函数导出方式
******************************************************************************/
#define WINAPI __attribute__((visibility("default")))

/******************************************************************************
*以下为PC操作设备接口函数
******************************************************************************/
#ifdef __cplusplus 
extern "C" {
#endif

	/******************************************************************************
	Function:
		打开设备：PC端打开下位机设备
	Input：
		无
	Output：
		int *fd：文件描述符
	Return：
		0：设备打开成功
		-1：设备打开失败
	Others：
		设备的操作句柄指针用于其他接口调用
	*****************************************************************************/
	int WINAPI TGOpenDev(int *fd);



	/******************************************************************************
	Function:
		关闭设备：PC端关闭下位机设备
	Return：
		0：设备关闭成功
		else：设备关闭失败
	Others：
	*****************************************************************************/
	int WINAPI	TGCloseDev( );

	/******************************************************************************
	Function:
		设备获取图像：设备的传感器获取指静脉图像
	Input：
		unsigned char* pImageData：图像数据
		int timeout:获取图像等待的时间（即：超过这个时间没有检测到touch就返回-1）
	Output：
		无
	Return：
		0：设备获取图像成功
		-1：设备获取图像失败
	Others：
		设备获取图像是指PC发送命令让设备自身获取外界环境图像
	*****************************************************************************/
	int WINAPI TGDevGetImage(unsigned char* pImageData,int timeout);


	/******************************************************************************
	Function:
		设备播放语音：设备播放提示语音
	Input：
		int iVoiceValue：语音内容
	Output：
		无
	Return：
		1：设备播放语音成功
		else：设备播放语音失败
	Others：
		语音内容已在宏中定义，设备第一次上电时，上位机要给设备设置一次语音音量，
		否则设备按最大音量播放语音。
	*****************************************************************************/
	int WINAPI	TGDevPlayVoice(int iVoiceValue);

	/******************************************************************************
	Function:
		获取设备固件号，即firmware
	Input：
		char *fw：获取到的固件号
	Output：
		无
	Return：
		1：获取设备固件号成功
		else：获取设备固件号失败
	Others：
		固件号为字符串
	*****************************************************************************/
	int WINAPI TGDevGetFW(char *fw);

	/******************************************************************************
	Function:
		获取设备序列号，即sn
	Input：
		char *sn：获取到的序列号
	Output：
		无
	Return：
		1：获取设备序列号成功
		else：获取设备序列号失败
	Others：
		序列号为字符串
	*****************************************************************************/
	int WINAPI TGDevGetSN(char *sn);
	
	/******************************************************************************
	Function:
		设置设备的模式：前比/后比
	Input：
		int mode：1：后比  ；  2：前比
	Output：
		无
	Return：
		1：设置成功
		else：设置失败
	Others：
		下次上电后生效
	*****************************************************************************/
	int WINAPI TGSetMode(int mode);
	
#ifdef __cplusplus 
}
#endif


#endif